MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX230F128L.atdf
         <register caption="ADC Input Scan Select Register 2" name="AD1CSSL2" offset="0x60" rw="RW" size="4" initval="0x0">
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000001" name="CSSL32" values="AD1CSSL2__CSSL32" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000002" name="CSSL33" values="AD1CSSL2__CSSL33" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000004" name="CSSL34" values="AD1CSSL2__CSSL34" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000008" name="CSSL35" values="AD1CSSL2__CSSL35" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000010" name="CSSL36" values="AD1CSSL2__CSSL36" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000020" name="CSSL37" values="AD1CSSL2__CSSL37" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000040" name="CSSL38" values="AD1CSSL2__CSSL38" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000080" name="CSSL39" values="AD1CSSL2__CSSL39" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000100" name="CSSL40" values="AD1CSSL2__CSSL40" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000200" name="CSSL41" values="AD1CSSL2__CSSL41" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000400" name="CSSL42" values="AD1CSSL2__CSSL42" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000800" name="CSSL43" values="AD1CSSL2__CSSL43" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00001000" name="CSSL44" values="AD1CSSL2__CSSL44" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00002000" name="CSSL45" values="AD1CSSL2__CSSL45" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00004000" name="CSSL46" values="AD1CSSL2__CSSL46" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00008000" name="CSSL47" values="AD1CSSL2__CSSL47" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00010000" name="CSSL48" values="AD1CSSL2__CSSL48" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00020000" name="CSSL49" values="AD1CSSL2__CSSL49" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00040000" name="CSSL50" values="AD1CSSL2__CSSL50" />
         </register>
         <register caption="" name="ADC1BUF0" offset="0x70" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF0" />
         </register>
         <register caption="" name="ADC1BUF1" offset="0x80" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF1" />
         </register>
         <register caption="" name="ADC1BUF2" offset="0x90" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF2" />
         </register>
         <register caption="" name="ADC1BUF3" offset="0xa0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF3" />
         </register>
         <register caption="" name="ADC1BUF4" offset="0xb0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF4" />
         </register>
         <register caption="" name="ADC1BUF5" offset="0xc0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF5" />
         </register>
         <register caption="" name="ADC1BUF6" offset="0xd0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF6" />
         </register>
         <register caption="" name="ADC1BUF7" offset="0xe0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF7" />
         </register>
         <register caption="" name="ADC1BUF8" offset="0xf0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF8" />
         </register>
         <register caption="" name="ADC1BUF9" offset="0x100" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF9" />
         </register>
         <register caption="" name="ADC1BUFA" offset="0x110" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFA" />
         </register>
         <register caption="" name="ADC1BUFB" offset="0x120" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFB" />
         </register>
         <register caption="" name="ADC1BUFC" offset="0x130" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFC" />
         </register>
         <register caption="" name="ADC1BUFD" offset="0x140" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFD" />
         </register>
         <register caption="" name="ADC1BUFE" offset="0x150" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFE" />
         </register>
         <register caption="" name="ADC1BUFF" offset="0x160" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFF" />
         </register>
      </register-group>
      <value-group caption="Analog-to-Digital Conversion Status bit" name="AD1CON1__DONE">
         <value caption="Analog-to-digital conversion is done" name="" value="0x1" />
         <value caption="Analog-to-digital conversion is not done or has not started" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Sample Enable bit" name="AD1CON1__SAMP">
         <value caption="The ADC sample and hold amplifier is sampling" name="" value="0x1" />
         <value caption="The ADC sample/hold amplifier is holding" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Sample Auto-Start bit" name="AD1CON1__ASAM">
         <value caption="Sampling begins immediately after last conversion completes; SAMP bit is automatically set." name="" value="0x1" />
         <value caption="Sampling begins when SAMP bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Conversion Sequence bit (when the first ADC interrupt is generated)" name="AD1CON1__CLRASAM">
         <value caption="Stop conversions when the first ADC interrupt is generated. Hardware clears the ASAM bit when the ADC interrupt is generated" name="" value="0x1" />
         <value caption="Normal operation, buffer contents will be overwritten by the next conversion sequence" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Trigger Source Select bits" name="AD1CON1__SSRC">
         <value caption="Internal counter ends sampling and starts conversion (auto convert)" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="CTMU ends sampling and starts conversion" name="" value="0x3" />
         <value caption="Timer 3 period match ends sampling and starts conversion" name="" value="0x2" />
         <value caption="Active transition on INT0 pin ends sampling and starts conversion" name="" value="0x1" />
         <value caption="Clearing SAMP bit ends sampling and starts conversion" name="" value="0x0" />
      </value-group>
