MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX230F128L.atdf
         <register caption="" name="IPC6" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="FSCMIS" />
            <bitfield mask="0x0000001C" name="FSCMIP" />
            <bitfield mask="0x00000300" name="RTCCIS" />
            <bitfield mask="0x00001C00" name="RTCCIP" />
            <bitfield mask="0x00030000" name="FCEIS" />
            <bitfield mask="0x001C0000" name="FCEIP" />
            <bitfield mask="0x03000000" name="CMP1IS" />
            <bitfield mask="0x1C000000" name="CMP1IP" />
         </register>
         <register caption="" name="IPC7" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP2IS" />
            <bitfield mask="0x0000001C" name="CMP2IP" />
            <bitfield mask="0x00000300" name="USBIS" />
            <bitfield mask="0x00001C00" name="USBIP" />
            <bitfield mask="0x00030000" name="SPI1IS" />
            <bitfield mask="0x001C0000" name="SPI1IP" />
            <bitfield mask="0x03000000" name="U1IS" />
            <bitfield mask="0x1C000000" name="U1IP" />
         </register>
         <register caption="" name="IPC8" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C1IS" />
            <bitfield mask="0x0000001C" name="I2C1IP" />
            <bitfield mask="0x00000300" name="CNIS" />
            <bitfield mask="0x00001C00" name="CNIP" />
            <bitfield mask="0x00030000" name="PMPIS" />
            <bitfield mask="0x001C0000" name="PMPIP" />
            <bitfield mask="0x03000000" name="SPI2IS" />
            <bitfield mask="0x1C000000" name="SPI2IP" />
         </register>
         <register caption="" name="IPC9" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U2IS" />
            <bitfield mask="0x0000001C" name="U2IP" />
            <bitfield mask="0x00000300" name="I2C2IS" />
            <bitfield mask="0x00001C00" name="I2C2IP" />
            <bitfield mask="0x00030000" name="U3IS" />
            <bitfield mask="0x001C0000" name="U3IP" />
            <bitfield mask="0x03000000" name="U4IS" />
            <bitfield mask="0x1C000000" name="U4IP" />
         </register>
         <register caption="" name="IPC10" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U5IS" />
            <bitfield mask="0x0000001C" name="U5IP" />
            <bitfield mask="0x00000300" name="CTMUIS" />
            <bitfield mask="0x00001C00" name="CTMUIP" />
            <bitfield mask="0x00030000" name="DMA0IS" />
            <bitfield mask="0x001C0000" name="DMA0IP" />
            <bitfield mask="0x03000000" name="DMA1IS" />
            <bitfield mask="0x1C000000" name="DMA1IP" />
         </register>
         <register caption="" name="IPC11" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA2IS" />
            <bitfield mask="0x0000001C" name="DMA2IP" />
            <bitfield mask="0x00000300" name="DMA3IS" />
            <bitfield mask="0x00001C00" name="DMA3IP" />
            <bitfield mask="0x00030000" name="CMP3IS" />
            <bitfield mask="0x001C0000" name="CMP3IP" />
            <bitfield mask="0x03000000" name="CAN1IS" />
            <bitfield mask="0x1C000000" name="CAN1IP" />
         </register>
         <register caption="" name="IPC12" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI3IS" />
            <bitfield mask="0x0000001C" name="SPI3IP" />
            <bitfield mask="0x00000300" name="SPI4IS" />
            <bitfield mask="0x00001C00" name="SPI4IP" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7" />
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6" />
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5" />
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4" />
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3" />
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2" />
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1" />
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for multi vectored mode" name="" value="0x1" />
         <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0" />
      </value-group>
